{
    "projects": [
        {
            "url": "https://github.com/maybeswapnil/Spotify-Playing-Now",
            "name": "Spotify API",
            "description": "#reactjs #express #n2yo",
            "descriptionpara": "Reference Application to connect to spotify API to request currently playing songs. Requires Client_ID and Client_Secret from Spotify. Download and change the values in ./credentials.env."
        },
        {
            "url": "https://satellite-tracker-3d.netlify.app/",
            "name": "Satellite Tracker",
            "description": "#spotifyapi #express #nodejs",
            "descriptionpara": "This App displays the real time information and location of the Satellites above you. We use N2YO APIs to extract data, that data is used to calculate the real x, y, z coordinates."
        },
        {
            "url": "https://csvtodotjson.netlify.app/",
            "name": "CSVtoJSONParser",
            "description": "#reactjs #express",
            "descriptionpara": "CSV-Parser helps you quickly convert popular data formats to the format you need. Data pasted and converted remains local on your computer."
        },
        {
            "url": "https://veryshortpath.netlify.app/",
            "name": "Very Short Path",
            "description": "#javascript #mocha #chai",
            "descriptionpara": "This is based on Dijkstra's Algorithm, it finds the shortest path between a given node (which is called the source node) and all other nodes in a graph."
        },
        {
            "url": "https://github.com/maybeswapnil/  ",
            "name": "S3 Unzip Module",
            "description": "#javascript #nodejs #npm",
            "descriptionpara": "Node package that can unzip the zip file on S3. Create an AWS Lambda function, name it, and zip all files from this package to upload the code (including node_modules)."
        },
        {
            "url": "https://www.npmjs.com/package/@caratlane/sqc",
            "name": "Sequalize Comment",
            "description": "#javascript #nodejs #npm",
            "descriptionpara": "A npm package to add comment to your query in Sequalize ORM. Developer needs to import and enclose the sequalize instance by it. Later developer can add comment in the respective model or query."
        },
        {
            "url": "https://github.com/maybeswapnil/  ",
            "name": "Mongo to MySQL",
            "description": "#javascript #nodejs #npm",
            "descriptionpara": "A Node.js ETL script to migrate Mongo data to MySQL, mapping MongoDB Objects to MySQL tables. Used multi threading concepts to maximise trnsfer speeds between the DBs"
        },
        {
            "url": "https://github.com/maybeswapnil/  ",
            "name": "Gmail to MySQL",
            "description": "#javascript #nodejs #npm",
            "descriptionpara": "A Node.js ETL script to migrate millions of emails to S3. This Script utilised threading concepts to maximise email retrival and consecutive insert queries"
        }
    ]
}